Обработки/Reports/_НДФЛ_35.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НДФЛ_35</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НДФЛ_35/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет дохода по ставке 35%",
		"0.12",
		"",
		Истина,
		);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ЗапросКДоходам(МВР)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВР;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОбороты.Субконто2 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ _ЦенныеБумагиКорп15
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
	|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВЫРАЗИТЬ(Субконто2 КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
	|				И ВЫРАЗИТЬ(Субконто2 КАК Справочник.Облигации).ДатаНачалаРазмещения >= ДАТАВРЕМЯ(2017, 1, 1),
	|			,
	|			) КАК НалоговыйУчетОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НалоговыйУчетОбороты.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КупонныйДоходПоОблигациям.Облигация КАК Облигация,
	|	КупонныйДоходПоОблигациям.СтавкаКупона КАК СтавкаКупона,
	|	КупонныйДоходПоОблигациям.Период КАК Период
	|ПОМЕСТИТЬ _СтавкиКупона
	|ИЗ
	|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|ГДЕ
	|	КупонныйДоходПоОблигациям.Облигация В
	|			(ВЫБРАТЬ
	|				_ЦенныеБумагиКорп15.ЦеннаяБумага
	|			ИЗ
	|				_ЦенныеБумагиКорп15)
	|	И КупонныйДоходПоОблигациям.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КупонныйДоходПоОблигациямСрезПоследних.Облигация,
	|	КупонныйДоходПоОблигациямСрезПоследних.СтавкаКупона,
	|	КупонныйДоходПоОблигациямСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(
	|			&НачалоПериода,
	|			Облигация В
	|				(ВЫБРАТЬ
	|					_ЦенныеБумагиКорп15.ЦеннаяБумага
	|				ИЗ
	|					_ЦенныеБумагиКорп15)) КАК КупонныйДоходПоОблигациямСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_СтавкиКупона.Облигация КАК Облигация,
	|	_СтавкиКупона.СтавкаКупона КАК СтавкаКупона,
	|	_СтавкиКупона.Период КАК КупонПериодН,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(_СтавкиКупона_Конец.Период), СЕКУНДА, -1), &КонецПериода) КАК КупонПериодК
	|ПОМЕСТИТЬ _ПериодыСтавкиКупона
	|ИЗ
	|	_СтавкиКупона КАК _СтавкиКупона
	|		ЛЕВОЕ СОЕДИНЕНИЕ _СтавкиКупона КАК _СтавкиКупона_Конец
	|		ПО _СтавкиКупона.Период < _СтавкиКупона_Конец.Период
	|			И _СтавкиКупона.Облигация = _СтавкиКупона_Конец.Облигация
	|
	|СГРУППИРОВАТЬ ПО
	|	_СтавкиКупона.Облигация,
	|	_СтавкиКупона.СтавкаКупона,
	|	_СтавкиКупона.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(_СтавкиКупона.Период) КАК Период
	|ПОМЕСТИТЬ _МинДатаКупона
	|ИЗ
	|	_СтавкиКупона КАК _СтавкиКупона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючевыеСтавкиЦБРФ.ДатаЗначения КАК ДатаЗначения,
	|	КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК КлючеваяСтавка
	|ПОМЕСТИТЬ _СтавкиЦБРФ
	|ИЗ
	|	РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
	|			&КонецПериода,
	|			Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
	|				И Прогноз = ЛОЖЬ) КАК КлючевыеСтавкиЦБРФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ _МинДатаКупона КАК _МинДатаКупона
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючевыеСтавкиЦБРФ.ДатаЗначения МЕЖДУ _МинДатаКупона.Период И &КонецПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КлючевыеСтавкиЦБРФ.ДатаЗначения,
	|	КлючевыеСтавкиЦБРФ.ЗначениеПоказателя
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		КлючевыеСтавкиЦБРФ.ДатаЗначения КАК ДатаЗначения,
	|		КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЗначениеПоказателя
	|	ИЗ
	|		РегистрСведений.ПроцентныеПоказатели КАК КлючевыеСтавкиЦБРФ
	|			ЛЕВОЕ СОЕДИНЕНИЕ _МинДатаКупона КАК _МинДатаКупона
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		КлючевыеСтавкиЦБРФ.Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
	|		И КлючевыеСтавкиЦБРФ.Прогноз = ЛОЖЬ
	|		И КлючевыеСтавкиЦБРФ.Период <= &КонецПериода
	|		И КлючевыеСтавкиЦБРФ.ДатаЗначения < _МинДатаКупона.Период
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		КлючевыеСтавкиЦБРФ.ДатаЗначения УБЫВ,
	|		КлючевыеСтавкиЦБРФ.Период УБЫВ) КАК КлючевыеСтавкиЦБРФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтавкиЦБРФ.ДатаЗначения КАК СтавкаПериодН,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(СтавкиЦБРФ_Конец.ДатаЗначения), СЕКУНДА, -1), &КонецПериода) КАК СтавкаПериодК,
	|	СтавкиЦБРФ.КлючеваяСтавка КАК КлючеваяСтавка
	|ПОМЕСТИТЬ _ПериодыСтавкиЦБ
	|ИЗ
	|	_СтавкиЦБРФ КАК СтавкиЦБРФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ _СтавкиЦБРФ КАК СтавкиЦБРФ_Конец
	|		ПО СтавкиЦБРФ.ДатаЗначения < СтавкиЦБРФ_Конец.ДатаЗначения
	|
	|СГРУППИРОВАТЬ ПО
	|	СтавкиЦБРФ.ДатаЗначения,
	|	СтавкиЦБРФ.КлючеваяСтавка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеКалендаря.Дата КАК Дата,
	|	_ПериодыСтавкиЦБ.КлючеваяСтавка КАК КлючеваяСтавка,
	|	1 КАК Счетчик,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, ГОД), КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ГОД), ДЕНЬ) + 1 КАК ДнейВГоду
	|ПОМЕСТИТЬ _СтавкиПоДням
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ _МинДатаКупона КАК _МинДатаКупона
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыСтавкиЦБ КАК _ПериодыСтавкиЦБ
	|		ПО (ДанныеКалендаря.Дата МЕЖДУ _ПериодыСтавкиЦБ.СтавкаПериодН И _ПериодыСтавкиЦБ.СтавкаПериодК)
	|ГДЕ
	|	ДанныеКалендаря.Дата МЕЖДУ _МинДатаКупона.Период И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК Аналитика
	|ПОМЕСТИТЬ _СписокДоходы
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И УчетныйАктив В (&СписокАктивов)
	|				И АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)) КАК НастройкиУчетаАктивовСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И УчетныйАктив В (&СписокАктивов)
	|				И АналитикаДоходовОтРеализации <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)) КАК НастройкиУчетаАктивовСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И УчетныйАктив В (&СписокАктивов)
	|				И АналитикаДоходовПоследнееПогашение <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)) КАК НастройкиУчетаАктивовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОбороты.Субконто1 КАК ПрочиеДоходыРасходы,
	|	НалоговыйУчетОбороты.Субконто2 КАК ЦеннаяБумага,
	|	НалоговыйУчетОбороты.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ОплатаОснования.Основание, НалоговыйУчетОбороты.Регистратор) КАК ДвигательРегистров,
	|	НалоговыйУчетОбороты.СуммаОборотКт КАК Доход,
	|	0 КАК Расход
	|ПОМЕСТИТЬ _Доходы
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						_СписокДоходы.Аналитика
	|					ИЗ
	|						_СписокДоходы)
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						_ЦенныеБумагиКорп15.ЦеннаяБумага
	|					ИЗ
	|						_ЦенныеБумагиКорп15),
	|			,
	|			) КАК НалоговыйУчетОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
	|		ПО НалоговыйУчетОбороты.Регистратор = ОплатаОснования.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НалоговыйУчетОбороты.Субконто1,
	|	НалоговыйУчетОбороты.Субконто2,
	|	НалоговыйУчетОбороты.Регистратор,
	|	ЕСТЬNULL(ОплатаОснования.Основание, НалоговыйУчетОбороты.Регистратор),
	|	0,
	|	НалоговыйУчетОбороты.СуммаОборотДт
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						_СписокДоходы.Аналитика
	|					ИЗ
	|						_СписокДоходы)
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						_ЦенныеБумагиКорп15.ЦеннаяБумага
	|					ИЗ
	|						_ЦенныеБумагиКорп15),
	|			,
	|			) КАК НалоговыйУчетОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
	|		ПО НалоговыйУчетОбороты.Регистратор = ОплатаОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|	КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование КАК ЦеннаяБумага,
	|	_Доходы.ПрочиеДоходыРасходы КАК ПрочиеДоходыРасходы,
	|	_Доходы.ДвигательРегистров КАК ДвигательРегистров,
	|	СУММА(_Доходы.Доход) КАК Доход,
	|	СУММА(_Доходы.Расход) КАК Расход,
	|	СУММА(_Доходы.Доход - _Доходы.Расход) КАК Прибыль
	|ИЗ
	|	_Доходы КАК _Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
	|		ПО _Доходы.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
	|		ПО _Доходы.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	_Доходы.ПрочиеДоходыРасходы,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|	КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Доходы.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование,
	|	_Доходы.ДвигательРегистров
	|ИТОГИ
	|	СУММА(Доход),
	|	СУММА(Расход),
	|	СУММА(Прибыль)
	|ПО
	|	ЦеннаяБумага";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	
	СписокАктивов = Новый Массив;
	СписокАктивов.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);
	
	Запрос.УстановитьПараметр("СписокАктивов", СписокАктивов);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции	

Функция ЗапросПартии(МВР)
	
	// 1-й запрос
	// В случае, если купон нулевой (купили за 0, или прошло погашение), при очередном погашении купона
	// документ делает движения по партиям с нулевыми ресурсами. Такие записи в виртуальную таблицу ОстаткиИОбороты не попадают
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВР;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумаг.Партия КАК Партия,
	|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
	|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
	|	БухПартииЦенныхБумаг.Количество КАК Количество,
	|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|ГДЕ
	|	БухПартииЦенныхБумаг.Организация = &Организация
	|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДУ
	|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|	И БухПартииЦенныхБумаг.ЦеннаяБумага В
	|			(ВЫБРАТЬ
	|				_ЦенныеБумагиКорп15.ЦеннаяБумага
	|			ИЗ
	|				_ЦенныеБумагиКорп15)
	|	И БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И БухПартииЦенныхБумаг.Количество = 0
	|	И БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета = 0
	|	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) = ТИП(Документ.ПогашениеКупона)
	|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеннаяБумага,
	|	Партия,
	|	СтрокаПартии,
	|	Регистратор";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	// 2-й запрос
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВР;
	
	// сначала возьмем "нормальные" остатки и обороты	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.Партия КАК Партия,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.СтрокаПартии КАК СтрокаПартии,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	               |	БухПартииЦенныхБумагОстаткиИОбороты.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход
	               |ПОМЕСТИТЬ _Партии
	               |ИЗ
	               |	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			Движения,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДУ
	               |				И ВидУчета = ЗНАЧЕНИЕ(перечисление.ВидыУчета.НалоговыйУчет)
	               |				И ЦеннаяБумага В
	               |					(ВЫБРАТЬ
	               |						_ЦенныеБумагиКорп15.ЦеннаяБумага
	               |					ИЗ
	               |						_ЦенныеБумагиКорп15)) КАК БухПартииЦенныхБумагОстаткиИОбороты
	               |ГДЕ
	               |	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток > 0
	               |	И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПогашениеКупона), ТИП(Документ.СписаниеЦеннойБумаги))";
	
	// Коля 16.11.2020 - установил фильтр по типам документов, убрав погашение, а то из-за него валились ошибки
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	
	
	// теперь присоединим "потерянные" движения
	
	КоличествоСтрок = Таблица.Количество();
	Для инд = 1 По КоличествоСтрок Цикл
		ТекстЗапроса = ТекстЗапроса +"	
		|
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии,
		|	&Док"+инд +",
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период"+ инд + ",
		|			ЦеннаяБумага = &ЦБ"+ инд + "
		|				И Партия = &Партия"+ инд + "
		|				И СтрокаПартии = &СтрокаПартия"+ инд + "
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК БухПартииЦенныхБумагОстатки
		|";
		
		
		Запрос.УстановитьПараметр("Док"+инд, Таблица[инд-1].Регистратор);
		Запрос.УстановитьПараметр("Период"+ инд, Таблица[инд-1].Регистратор.Дата);
		Запрос.УстановитьПараметр("ЦБ"+ инд, Таблица[инд-1].ЦеннаяБумага);
		Запрос.УстановитьПараметр("Партия"+ инд, Таблица[инд-1].Партия);
		Запрос.УстановитьПараметр("СтрокаПартия"+ инд, Таблица[инд-1].СтрокаПартии);
		
	КонецЦикла;	
	
	// Коля 16.11.2020 - добавил учет документов ИсполнениеОбязательствПоСделке т.к. их тоже нужно учитывать, также добавил погашение, но выше она фильтруется. Пока фильтруется т.к. не знаю как его обрабатывать
	
	// 3-й запрос. Доходы по партиям
	ТекстЗапроса = ТекстЗапроса + " 
		| ;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Партии.Партия КАК Партия,
		|	_Партии.СтрокаПартии КАК СтрокаПартии,
		|	_Партии.Регистратор КАК Регистратор,
		|	_Партии.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	_Партии.КоличествоРасход КАК КоличествоРасход,
		|	_Партии.СтоимостьКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
		|	_Партии.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 0
		|	КОНЕЦ КАК КоличествоПартия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА СделкаЦенныеБумаги.СуммаКупона / СделкаЦенныеБумаги.Количество * _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона / ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество * _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ПогашениеКупона.СуммаКупона / ПогашениеКупона.Количество * _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА ОснованиеСписания.СуммаКупона / ОснованиеСписания.Количество * _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 0
		|	КОНЕЦ КАК КупонДок,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА _Партии.СтоимостьКупонаВВалютеУчетаРасход / _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА _Партии.СтоимостьКупонаВВалютеУчетаРасход / _Партии.КоличествоРасход
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА _Партии.СтоимостьКупонаВВалютеУчетаНачальныйОстаток / _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА _Партии.СтоимостьКупонаВВалютеУчетаНачальныйОстаток / _Партии.КоличествоНачальныйОстаток
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 0
		|	КОНЕЦ КАК КупонПокупкаЕд,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА СделкаЦенныеБумаги.СуммаКупона / СделкаЦенныеБумаги.Количество
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона / ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ПогашениеКупона.СуммаКупона / ПогашениеКупона.Количество
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА ОснованиеСписания.СуммаКупона / ОснованиеСписания.Количество
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 0
		|	КОНЕЦ КАК КупонПродажаЕд,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА НАЧАЛОПЕРИОДА(_Партии.Регистратор.Дата, ДЕНЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА НАЧАЛОПЕРИОДА(_Партии.Регистратор.Дата, ДЕНЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_Партии.Регистратор КАК Документ.ПогашениеКупона).ДатаФиксации
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(_Партии.Регистратор КАК Документ.СписаниеЦеннойБумаги).ПогашениеЦеннойБумаги.ДатаФиксации
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(_Партии.Регистратор КАК Документ.СписаниеЦеннойБумаги).ПогашениеЦеннойБумаги.ДатаФиксации
		|	КОНЕЦ КАК ДатаОперации,
		|	_ПериодыСтавкиКупона.СтавкаКупона КАК СтавкаКупона,
		|	_ПериодыСтавкиКупона.КупонПериодН КАК КупонПериодН,
		|	_ПериодыСтавкиКупона.КупонПериодК КАК КупонПериодК,
		|	ВЫБОР
		|		КОГДА _Партии.Партия.Дата > _ПериодыСтавкиКупона.КупонПериодН
		|			ТОГДА РАЗНОСТЬДАТ(_ПериодыСтавкиКупона.КупонПериодН, _Партии.Партия.Дата, ДЕНЬ)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДнейКупонПокупка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА РАЗНОСТЬДАТ(_ПериодыСтавкиКупона.КупонПериодН, _Партии.Регистратор.Дата, ДЕНЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА РАЗНОСТЬДАТ(_ПериодыСтавкиКупона.КупонПериодН, _Партии.Регистратор.Дата, ДЕНЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА РАЗНОСТЬДАТ(_ПериодыСтавкиКупона.КупонПериодН, _ПериодыСтавкиКупона.КупонПериодК, ДЕНЬ) + 1
		|		КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА РАЗНОСТЬДАТ(_ПериодыСтавкиКупона.КупонПериодН, _ПериодыСтавкиКупона.КупонПериодК, ДЕНЬ) + 1
		|	КОНЕЦ КАК ДнейКупонПродажа
		|ПОМЕСТИТЬ _ВыходныеДанные
		|ИЗ
		|	_Партии КАК _Партии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеКупона КАК ПогашениеКупона
		|		ПО _Партии.Регистратор = ПогашениеКупона.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО _Партии.Регистратор = СделкаЦенныеБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО _Партии.Регистратор = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыСтавкиКупона КАК _ПериодыСтавкиКупона
		|		ПО _Партии.ЦеннаяБумага = _ПериодыСтавкиКупона.Облигация
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.Сделка) ИЛИ ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|					ТОГДА НАЧАЛОПЕРИОДА(_Партии.Регистратор.Дата, ДЕНЬ)
		|				КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|					ТОГДА ВЫРАЗИТЬ(_Партии.Регистратор КАК Документ.ПогашениеКупона).ДатаФиксации
		|				КОГДА ТИПЗНАЧЕНИЯ(_Партии.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|					ТОГДА ВЫРАЗИТЬ(_Партии.Регистратор КАК Документ.СписаниеЦеннойБумаги).ПогашениеЦеннойБумаги.ДатаФиксации
		|			КОНЕЦ МЕЖДУ _ПериодыСтавкиКупона.КупонПериодН И _ПериодыСтавкиКупона.КупонПериодК)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЦеннойБумаги КАК СписаниеЦеннойБумаги
		|		ПО _Партии.Регистратор = СписаниеЦеннойБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ОснованиеСписания
		|		ПО (СписаниеЦеннойБумаги.ПогашениеЦеннойБумаги = ОснованиеСписания.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период,
		|	_ВыходныеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВыходныеДанные.КупонПериодН КАК КупонПериодН
		|ПОМЕСТИТЬ _Номиналы
		|ИЗ
		|	_ВыходныеДанные КАК _ВыходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО (_ВыходныеДанные.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага)
		|			И (_ВыходныеДанные.КупонПериодН >= НоминалыЦенныхБумаг.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВыходныеДанные.ЦеннаяБумага,
		|	_ВыходныеДанные.КупонПериодН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВыходныеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВыходныеДанные.Партия КАК Партия,
		|	_ВыходныеДанные.СтрокаПартии КАК СтрокаПартии,
		|	_ВыходныеДанные.Регистратор КАК Регистратор,
		|	_ВыходныеДанные.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	_ВыходныеДанные.КоличествоРасход КАК КоличествоРасход,
		|	_ВыходныеДанные.СтоимостьКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
		|	_ВыходныеДанные.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
		|	_ВыходныеДанные.КоличествоПартия КАК КоличествоПартия,
		|	_ВыходныеДанные.КупонДок КАК КупонДок,
		|	_ВыходныеДанные.КупонПокупкаЕд КАК КупонПокупкаЕд,
		|	_ВыходныеДанные.КупонПродажаЕд КАК КупонПродажаЕд,
		|	_ВыходныеДанные.ДатаОперации КАК ДатаОперации,
		|	_ВыходныеДанные.СтавкаКупона КАК СтавкаКупона,
		|	_ВыходныеДанные.КупонПериодН КАК КупонПериодН,
		|	_ВыходныеДанные.КупонПериодК КАК КупонПериодК,
		|	_ВыходныеДанные.ДнейКупонПокупка КАК ДнейКупонПокупка,
		|	_ВыходныеДанные.ДнейКупонПродажа КАК ДнейКупонПродажа,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал
		|ИЗ
		|	_ВыходныеДанные КАК _ВыходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Номиналы КАК _Номиналы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО _Номиналы.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И _Номиналы.Период = НоминалыЦенныхБумаг.Период
		|		ПО _ВыходныеДанные.ЦеннаяБумага = _Номиналы.ЦеннаяБумага
		|			И _ВыходныеДанные.КупонПериодН = _Номиналы.КупонПериодН
		|ИТОГИ ПО
		|	ЦеннаяБумага";	
	
	Запрос.Текст = ТекстЗапроса;	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
	
КонецФункции	

Функция ДанныеРасчета(МВР, Инкримент, Начало, Конец, ТаблицаРешений)
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПериодНачало", Начало);
	Отбор.Вставить("ПериодКонец", Конец);
	
	СтрокиТаблицы = ТаблицаРешений.НайтиСтроки(Отбор);
	Если СтрокиТаблицы.Количество() = 0 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МВР;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтавкиПоДням.КлючеваяСтавка + &Инкримент КАК КлючеваяСтавка,
		|	СУММА(_СтавкиПоДням.Счетчик) КАК Счетчик,
		|	_СтавкиПоДням.ДнейВГоду КАК ДнейВГоду
		|ИЗ
		|	_СтавкиПоДням КАК _СтавкиПоДням
		|ГДЕ
		|	_СтавкиПоДням.Дата МЕЖДУ &Начало И &Конец
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтавкиПоДням.КлючеваяСтавка,
		|	_СтавкиПоДням.ДнейВГоду";
		
		Запрос.УстановитьПараметр("Начало", Начало);
		Запрос.УстановитьПараметр("Конец", Конец);
		Запрос.УстановитьПараметр("Инкримент", Инкримент);
		
		База = Запрос.Выполнить().Выгрузить();
		БазаТекст = БазаВСтроку(База);
		СтоимостьКупонаАльтернатива = РассчитатьПроцент(1000, База);
		
		НоваяСтрока = ТаблицаРешений.Добавить();
		НоваяСтрока.ПериодНачало = Начало;
		НоваяСтрока.ПериодКонец = Конец;
		НоваяСтрока.База = База;
		НоваяСтрока.БазаТекст = БазаТекст;
		НоваяСтрока.СтоимостьКупонаАльтернатива = СтоимостьКупонаАльтернатива;
		
	Иначе
		Для Каждого СтрокаТаблицы из СтрокиТаблицы Цикл 
			База = СтрокаТаблицы.База;
			БазаТекст = СтрокаТаблицы.БазаТекст;
			СтоимостьКупонаАльтернатива = СтрокаТаблицы.СтоимостьКупонаАльтернатива;			
		КонецЦикла;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("База",База);
	Результат.Вставить("БазаТекст",БазаТекст);
	Результат.Вставить("СтоимостьКупонаАльтернатива",СтоимостьКупонаАльтернатива);
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьПроцент(Номинал, вхБаза)
	
	Результат = 0;	
	Если вхБаза <> 0 Тогда
		Для Каждого СтрокаБаза ИЗ вхБаза Цикл
			Результат = Результат + 
			Номинал*СтрокаБаза.КлючеваяСтавка/100*СтрокаБаза.Счетчик/СтрокаБаза.ДнейВГоду;
		КонецЦикла;	
	КонецЕсли;	
	Возврат Результат;	
	
КонецФункции	

Функция БазаВСтроку(вхБаза)
	
	Результат = "";
	
	Если вхБаза <> 0 Тогда		
		Для Каждого СтрокаБаза ИЗ вхБаза Цикл
			Результат = Результат + 
			СтрокаБаза.КлючеваяСтавка +"% ("+ СтрокаБаза.ДнейВГоду+") - " + СтрокаБаза.Счетчик + " дн.; ";
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция АльтернативныйДоход(МВР, СтрокаВыборки, Инкримент, ТаблицаРешений)
	
	Если ТаблицаРешений = Неопределено Тогда 
		ТаблицаРешений = Новый ТаблицаЗначений;
		ТаблицаРешений.Колонки.Добавить("ПериодНачало");
		ТаблицаРешений.Колонки.Добавить("ПериодКонец");
		ТаблицаРешений.Колонки.Добавить("База");
		ТаблицаРешений.Колонки.Добавить("БазаТекст");
		ТаблицаРешений.Колонки.Добавить("СтоимостьКупонаАльтернатива");
	КонецЕсли;	
	
	
	
	Если ТипЗнч(СтрокаВыборки.Регистратор) = Тип("ДокументСсылка.Сделка")
		ИЛИ ТипЗнч(СтрокаВыборки.Регистратор) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда 
		ДанныеНачало = ДанныеРасчета(МВР, Инкримент, СтрокаВыборки.КупонПериодН, НачалоДня(СтрокаВыборки.Партия.Дата)-1, ТаблицаРешений); 
		ДанныеКонец = ДанныеРасчета(МВР, Инкримент,СтрокаВыборки.КупонПериодН, НачалоДня(СтрокаВыборки.Регистратор.Дата)-1, ТаблицаРешений);
	ИначеЕсли ТипЗнч(СтрокаВыборки.Регистратор)=Тип("ДокументСсылка.ПогашениеКупона") 
		ИЛИ ТипЗнч (СтрокаВыборки.Регистратор)=Тип("ДокументСсылка.СписаниеЦеннойБумаги") 	Тогда 
		Если НачалоДня(СтрокаВыборки.Партия.Дата) >= СтрокаВыборки.КупонПериодН Тогда
			ДанныеНачало = ДанныеРасчета(МВР, Инкримент, СтрокаВыборки.КупонПериодН, НачалоДня(СтрокаВыборки.Партия.Дата)-1, ТаблицаРешений);
		Иначе
			ДанныеНачало = Новый Структура;
			ДанныеНачало.Вставить("БазаТекст", "");
			ДанныеНачало.Вставить("СтоимостьКупонаАльтернатива", 0);
		КонецЕсли;	
		ДанныеКонец = ДанныеРасчета(МВР, Инкримент, СтрокаВыборки.КупонПериодН, СтрокаВыборки.КупонПериодК, ТаблицаРешений); 		
	КонецЕсли;	
	
	Результат = Новый Структура;	
	
	//Результат.Вставить("БазаНачало", БазаНачало);
	//Результат.Вставить("БазаКонец", БазаКонец);
	Результат.Вставить("БазаНачалоТекст", ДанныеНачало.БазаТекст );
	Результат.Вставить("БазаКонецТекст", ДанныеКонец.БазаТекст);	
	
	СтоимостьКупонаНачалоА = ДанныеНачало.СтоимостьКупонаАльтернатива*СтрокаВыборки.Номинал/1000;
	СтоимостьКупонаКонецА = ДанныеКонец.СтоимостьКупонаАльтернатива*СтрокаВыборки.Номинал/1000;
	
	Результат.Вставить("СтоимостьКупонаНачалоА", СтоимостьКупонаНачалоА);
	Результат.Вставить("СтоимостьКупонаКонецА", СтоимостьКупонаКонецА);
	Результат.Вставить("СуммаКупонаНачалоА", СтоимостьКупонаНачалоА*СтрокаВыборки.КоличествоПартия);
	Результат.Вставить("СуммаКупонаКонецА", СтоимостьКупонаКонецА*СтрокаВыборки.КоличествоПартия);
	
	Результат.Вставить("ПрибыльА", (СтоимостьКупонаКонецА-СтоимостьКупонаНачалоА)*СтрокаВыборки.КоличествоПартия);

			
	Возврат Результат;
	
КонецФункции	

Процедура Сформировать(ДокументРезультат, Инкримент)	Экспорт
	
	Перем ТаблицаРешений;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДУ");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ДокументРезультат.Очистить();
	
	МВР = Новый МенеджерВременныхТаблиц;
	Результат = ЗапросКДоходам(МВР);
	
	РезультатПартии = ЗапросПартии(МВР);
	ВыборкаПартииЦБ = РезультатПартии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Отчет = ПолучитьМакет("Отчет");
	
	ОбластьШапка = Отчет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.СчетДУ = СчетДУ;
	ОбластьШапка.Параметры.ДатаНачала = Период.ДатаНачала;
	ОбластьШапка.Параметры.ДатаОкончания = Период.ДатаОкончания;
	ДокументРезультат.Вывести(ОбластьШапка);
	
	//итог сразу
	
	ОбластьИтог = Отчет.ПолучитьОбласть("ОбластьИтог");
	ДокументРезультат.Вывести(ОбластьИтог);
	
	
	//ставки 
	ТаблицаСтавок = МВР.Таблицы["_ПериодыСтавкиЦБ"].ПолучитьДанные().Выгрузить();
	ТаблицаСтавок.Сортировать("СтавкаПериодН");
	
	ОбластьШапкаСтавки = Отчет.ПолучитьОбласть("ШапкаСтавки");
	ДокументРезультат.Вывести(ОбластьШапкаСтавки);
	
	ОбластьСтавкаЦБ = Отчет.ПолучитьОбласть("СтавкаЦБ");
	Для Каждого СтрокаСтавка из ТаблицаСтавок Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтавкаЦБ.Параметры,СтрокаСтавка); 
		ДокументРезультат.Вывести(ОбластьСтавкаЦБ);
	КонецЦикла;	
	
	//доходы
	Сумма35Всего = 0;
	
	ОбластьШапкаЦБ = Отчет.ПолучитьОбласть("ШапкаЦБ"); 
	ОбластьШапкаПартия = Отчет.ПолучитьОбласть("ШапкаПартия"); 
	
	ОбластьЦБ = Отчет.ПолучитьОбласть("ОбластьЦБ");
	ОбластьДок = Отчет.ПолучитьОбласть("ОбластьДок");	
	ОбластьПартия = Отчет.ПолучитьОбласть("ОбластьПартия");
	ОбластьАльтернатива = Отчет.ПолучитьОбласть("ОбластьАльтернатива");
	ОбластьПодитог = Отчет.ПолучитьОбласть("ОбластьПодитог");
		
	ВыборкаЦБ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Пока ВыборкаЦБ.Следующий() Цикл 
		
		ДокументРезультат.Вывести(ОбластьШапкаЦБ);
		ДокументРезультат.НачатьГруппуСтрок();
		
		ЗаполнитьЗначенияСвойств(ОбластьЦБ.Параметры, ВыборкаЦБ);
		ДокументРезультат.Вывести(ОбластьЦБ);
		
		ВыборкаДок = ВыборкаЦБ.Выбрать();
		Пока ВыборкаДок.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьДок.Параметры, ВыборкаДок);
			ДокументРезультат.Вывести(ОбластьДок);
		КонецЦикла;
		
		// доход по партиям
		ЗеленаяСумма = 0;  	//доход по партиям
		СиняяСумма = 0; 	//альтернативный доход	
		
		ВыборкаПартииЦБ.Сбросить();
		Пока ВыборкаПартииЦБ.НайтиСледующий(ВыборкаЦБ.ЦеннаяБумага, "ЦеннаяБумага") Цикл
			
			ДокументРезультат.НачатьГруппуСтрок();
			ДокументРезультат.Вывести(ОбластьШапкаПартия);
			
			ВыборкаПартииПартии = ВыборкаПартииЦБ.Выбрать();
			Пока ВыборкаПартииПартии.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(ОбластьПартия.Параметры, ВыборкаПартииПартии); 
				Прибыль = ВыборкаПартииПартии.КупонДок - ВыборкаПартииПартии.СтоимостьКупонаВВалютеУчетаРасход;
				ОбластьПартия.Параметры.Прибыль = Прибыль;
				ЗеленаяСумма = ЗеленаяСумма + Прибыль;
				ДокументРезультат.Вывести(ОбластьПартия);
				
				//здесь считаем "альтернативный доход"
				Альтернатива = АльтернативныйДоход(МВР, ВыборкаПартииПартии, Инкримент, ТаблицаРешений);
				ЗаполнитьЗначенияСвойств(ОбластьАльтернатива.Параметры, Альтернатива);
				СиняяСумма = СиняяСумма + Альтернатива.ПрибыльА;
				ДокументРезультат.Вывести(ОбластьАльтернатива);
				
			КонецЦикла;
			
			//под итог
			Сумма35 = (ЗеленаяСумма - СиняяСумма)*0.35;
			Если Сумма35 < 0 Тогда 
				Сумма35 = 0;
			КонецЕсли;
			Сумма35Всего = Сумма35Всего + Сумма35;
			
			ОбластьПодитог.Параметры.СиняяСумма = СиняяСумма;
			ОбластьПодитог.Параметры.ЗеленаяСумма = ЗеленаяСумма;
			ОбластьПодитог.Параметры.Сумма35 = Сумма35;
			ДокументРезультат.Вывести(ОбластьПодитог);
			
			
			ДокументРезультат.ЗакончитьГруппуСтрок();
		КонецЦикла;	
		ДокументРезультат.ЗакончитьГруппуСтрок();
	КонецЦикла;	
	
	ДокументРезультат.Области.СуммаВсего35.Значение = Сумма35Всего;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
